src/testsuite/sysbench/results/select_random_ranges.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 37657.95 qps: 37657.95 (r/w/o: 37657.95/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 37658.43 qps: 37658.43 (r/w/o: 37658.43/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2260973
        write:                           0
        other:                           0
        total:                           2260973
    transactions:                        2260974 (37680.74 per sec.)
    queries:                             2260973 (37680.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      37680.7418
    time elapsed:                        60.0051s
    total number of events:              2260974

Latency (ms):
         min:                                    0.28
         avg:                                    1.70
         max:                                   30.32
         95th percentile:                        3.13
         sum:                              3835457.71

Threads fairness:
    events (avg/stddev):           35327.0781/6575.77
    execution time (avg/stddev):   59.9290/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 37861.49 qps: 37861.49 (r/w/o: 37861.49/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 37716.60 qps: 37716.60 (r/w/o: 37716.60/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2274548
        write:                           0
        other:                           0
        total:                           2274548
    transactions:                        2274548 (37908.07 per sec.)
    queries:                             2274548 (37908.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      37908.0740
    time elapsed:                        60.0063s
    total number of events:              2274548

Latency (ms):
         min:                                    0.70
         avg:                                    1.69
         max:                                   31.98
         95th percentile:                        3.19
         sum:                              3835349.38

Threads fairness:
    events (avg/stddev):           35539.1562/7179.97
    execution time (avg/stddev):   59.9273/0.02